Ledger (copy)/app/controllers/calculations_controller.rb

SELECT "calculations".* FROM "calculations"
---
  def index
    @calculations = Calculation.all
    @calculattions_by_date = @calculations.group_by(&:transaction_date)

INSERT INTO "calculations" ("value", "description", "created_at", "updated_at", "user_id", "status_type", "transaction_date") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @calculation = Calculation.new(calculation_params)


    respond_to do |format|
      if @calculation.save

UPDATE "calculations" SET "updated_at" = ?, "status_type" = ? WHERE "calculations"."id" = ?  [["updated_at", "2021-12-21 14:33:39.450481"], ["status_type", "PAID"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @calculation.update(calculation_params)

DELETE FROM "calculations" WHERE "calculations"."id" = ?  [["id", 44]]
---
  def destroy
    @calculation.destroy

SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_calculation
      @calculation = Calculation.find(params[:id])