base experiment/app/controllers/calculations_controller.rb

SELECT "calculations".* FROM "calculations"
---
  def index
    @calculations = Calculation.all

INSERT INTO "calculations" ("value", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["value", "16"], ["description", "rishav 4"], ["created_at", "2021-12-14 07:59:44.793918"], ["updated_at", "2021-12-14 07:59:44.793918"], ["user_id", 5]]
---
  def create
    @calculation = Calculation.new(calculation_params)


    respond_to do |format|
      if @calculation.save

DELETE FROM "calculations" WHERE "calculations"."id" = ?  [["id", 4]]
---
  def destroy
    @calculation.destroy

SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_calculation
      @calculation = Calculation.find(params[:id])