Experiment (3rd copy)/app/controllers/calculations_controller.rb

  def index
    @calculations = Calculation.all
---
SELECT "calculations".* FROM "calculations"

  def create
    @calculation = Calculation.new(calculation_params)


    respond_to do |format|
      if @calculation.save
---
INSERT INTO "calculations" ("value", "description", "created_at", "updated_at", "user_id", "transaction_date") VALUES (?, ?, ?, ?, ?, ?)  [["value", "445"], ["description", "sadsd"], ["created_at", "2021-12-23 04:25:04.024301"], ["updated_at", "2021-12-23 04:25:04.024301"], ["user_id", 5], ["transaction_date", "2021-12-23 04:24:00"]]

  def update
    respond_to do |format|
      if @calculation.update(calculation_params)
---
UPDATE "calculations" SET "updated_at" = ?, "status_type" = ? WHERE "calculations"."id" = ?  [["updated_at", "2021-12-21 14:33:39.450481"], ["status_type", "PAID"], ["id", 2]]

  def destroy
    @calculation.destroy
---
DELETE FROM "calculations" WHERE "calculations"."id" = ?  [["id", 4]]

    def set_calculation
      @calculation = Calculation.find(params[:id])
---
SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]