Experiment/app/controllers/calculations_controller.rb

  def create
    @calculation = Calculation.new(calculation_params)


    respond_to do |format|
      if @calculation.save
---
INSERT INTO "calculations" ("value", "description", "created_at", "updated_at", "user_id", "status_type", "transaction_date") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @calculation.update(calculation_params)
---
UPDATE "calculations" SET "updated_at" = ?, "status_type" = ? WHERE "calculations"."id" = ?  [["updated_at", "2021-12-21 14:33:39.450481"], ["status_type", "PAID"], ["id", 2]]

  def destroy
    @calculation.destroy
---
DELETE FROM "calculations" WHERE "calculations"."id" = ?  [["id", 47]]

    def set_calculation
      @calculation = Calculation.find(params[:id])
---
SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]